class EveningAzkarItem {
  final String zekr;
  final int count;

  EveningAzkarItem.azkarItem({required this.zekr, required this.count});

  static List<EveningAzkarItem> eveningAzkar = [
    EveningAzkarItem.azkarItem(
      zekr:
          'أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.',
      count: 1,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'اللّهـمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ، خَلَقْتَني وَأَنا عَبْدُك، وَأَنا عَلى عَهْدِكَ وَوَعْدِكَ ما اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ ما صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لي، فَإِنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاّ أَنْتَ.',
      count: 1,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'اللّهـمَّ إِنِّي أَمْسَيْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لا إلهَ إِلاَّ أَنْتَ وَحْدَكَ لا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ.',
      count: 4,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'اللّهـمَّ ما أَمْسَى بي مِن نِعْمَةٍ أَوْ بِأَحَدٍ مِن خَلْقِكَ، فَمِنْكَ وَحْدَكَ لا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.',
      count: 1,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'اللّهـمَّ عافِني في بَدَني، اللّهـمَّ عافِني في سَمْعي، اللّهـمَّ عافِني في بَصَري، لا إلهَ إلاّ أَنْتَ.',
      count: 1,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'اللّهـمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لا إلهَ إلاّ أَنْتَ.',
      count: 3,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'اللّهـمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللّهـمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللّهـمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللّهـمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.',
      count: 1,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'بِسْمِ اللهِ الّذي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلا فِي السَّماءِ وَهُوَ السَّمِيعُ العَلِيمُ.',
      count: 3,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'حَسْبِيَ اللَّهُ لا إِلَهَ إِلاَّ هُوَ، عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ.',
      count: 7,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'رَضِيتُ بِاللَّهِ رَبًّا، وَبِالإِسْلامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا.',
      count: 3,
    ),
    EveningAzkarItem.azkarItem(
      zekr: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.',
      count: 100,
    ),
    EveningAzkarItem.azkarItem(
      zekr:
          'لا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ، لَهُ المُلكُ وَلَهُ الحَمدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.',
      count: 10,
    ),
  ];
}
